robot_memory_templates = [
    "周一zozo 起晚了，上班迟到了，晚上不得不加班，没有运动。晚饭吃了好吃的火锅",
    "周二zozo昨天吃火锅吃坏了肚子，请假一天，在家打游戏，很开心，点了外卖小龙虾。新追的动漫更新了。每个周二周四更新，要在更新的时候提醒zozo",
    "周三zozo喝了很多咖啡，因为昨天起晚了。并且工作很多，整天坐在位置上，腰很痛",
    "周四zozo腰痛的受不了，去看了医生，医生说让ta多运动。她晚上回去吃了烧烤，她还很不喜欢吃蔬菜。晚上她预约了第二天的游泳。晚上动漫更新了，她非常高兴",
    "周五zozo成功的去游泳了！她非常高兴，晚上和朋友吃了潮汕牛肉火锅",
    "周六zozo本来和朋友去骑车，但是临时取消了，她正好解决了工作上需要做的事情。你劝说她去运动，但是她打游戏打的非常起劲，并没有去运动（无语）",
    "周日zozo腰又开始痛了，但是她还是不想运动，只是躺在床上躺了一天，晚上她随便吃了一点东西。并且立下flag她明天一定运动",
    "周一你又一次催促zozo运动，但是工作太多了，她加班到深夜。",
]                   