# 优化actions的提示词
actions = {
    # 基础动作
    'rest': "趴下休息",
    'sit': "坐下",
    'up': "起立",
    'balance': "恢复平衡",

    # 小动作（和自己or环境）
    'scrh': "挠挠身体",
    'ck': "左右看看",
    'snf': "探头嗅一嗅",
    'dg': "挖土",

    # 和人交互
    'come': "走过来",
    'hi': "打招呼",
    'hg': "拥抱",
    'hsk': "握手",

    # 小狗答复
    # 积极
    'nd': "点头",
    'gdb': "开心",
    'chr': "庆祝",
    'fiv': "击掌",
    # 消极
    'wh': "摇头",
    'ang': "愤怒",

    # 技能
    'cnt': """表示计数，用于回答数学题。
           例如，被问到1+1，需要先计算1+1=2，所以应该返回2个cnt，回复：cnt,cnt。
           被问到2*2，需要先计算2*2=4，所以应该返回4个cnt，回复：cnt,cnt,cnt,cnt""",

    # 小狗整活（高难度）
    'mw': "月球漫步舞步",
    'hds': "倒立",  # 执行手倒立
    'bf': "向后翻滚",  # 执行向后翻滚
}
